{"data":{"site":{"siteMetadata":{"title":"One is Mine","author":"Adam Gordon Bell"}},"markdownRemark":{"id":"69c8a337-2ba2-52ba-bc22-733d10eb79d3","excerpt":"Intro What is shapeless?  Well its a library for doing generic programming in Scala.  What is generic programming, well that is a little harder to explain…","html":"<h3>Intro</h3>\n<p>What is shapeless?  Well its a library for doing generic programming in Scala.  What is generic programming, well that is a little harder to explain.  Generic programming is the type of polymorphism your lanugage doesn’t support. That is how it was described by Simon Peyton.  </p>\n<p>To me, that description seems like circular reasoning, but hopefully it will all make sense by the time you get to the end of this list.</p>\n<h3>1. <a href=\"https://underscore.io/books/shapeless-guide/\">The Type Astronaut’s Guide to Shapeless Book</a></h3>\n<p>This free ebook from underscore walks through shapeless in some fun detail.  I recommend after reading it you attempt to build your CSV parser and after that try your own Json parser using the techniques learned in the book.</p>\n<h3>2. <a href=\"https://gitter.im/milessabin/shapeless\">The Shapeless Gitter channel</a></h3>\n<p>If you have questions after reading the shapeless book then gitter is a great place to go. There is an IRC channel and a mailing list as well, but gitter seems to be where the action is.</p>\n<h3>3. <a href=\"https://www.scala-exercises.org/shapeless/generic\">Shapeless Exercises</a></h3>\n<p>Scala Exercises has a whole section of shapeless exercises that you can use to cement your knowledge of the shapeless library.</p>\n<h3>4. <a href=\"https://corecursive.com/008-generic-programming-and-shapeless-with-miles-sabin/\">Generic Programming and Shapeless with Miles Sabin</a></h3>\n<p>In this interview with Miles Sabbin, the creator of shapeless, he explains how he created shapeless and also the reason why he created it.  The why is actually a pretty interesting story.\nThis was one of the first interviews I did for my podcast, and talking with Miles helped me understand some of the big picture ideas behind type level programming.</p>\n<h3>5. <a href=\"https://medium.com/build-and-learn/is-shapeless-worth-it-what-is-shapeless-anyway-900cba6b717a\">Is Shapeless worth it?</a></h3>\n<p>An article tackling whether using shapeless is worth it.  Spoiler alert, it is if you like type safey and avoid boiler plate.</p>\n<h3>6. <a href=\"https://jto.github.io/articles/getting-started-with-shapeless/\">Getting Started with Shapeless</a></h3>\n<p>@skaalf’s guide to getting started with shapeless.</p>\n<h3>7. <a href=\"https://twitter.com/milessabin\">@milessabin</a></h3>\n<p>Here is Miles on twitter. Follow him to keep up to date not just on shapeless but on many exicting type level projects.</p>\n<h3>8. <a href=\"https://www.youtube.com/watch?v=xG00ivPa9hk\">Code Mesh Kind PolyMorphism Talk</a></h3>\n<p>This talk by Miles is about Kind Polymorphism.  It is not totally related to Shapeless itself, but very interesting.  If you listen to the inteview in #4, you will hear me fail to understand what kind polymorphism is.  After this talk, it is making more sense.  </p>\n<h3>9. <a href=\"https://www.youtube.com/watch?v=Zt6LjUnOcFQ\">The Type Astronaut’s Guide to Shapeless Video</a></h3>\n<p>Here is a video version of the first link.  I think the book is actaully </p>\n<h3>10. <a href=\"https://github.com/milessabin/shapeless\">Shapeless Source</a></h3>\n<p>Last, but not least, is the source for shapeless.  </p>\n<h3>Wrapping up:</h3>\n<p>There we go.  So shapeless is geneic programming and generic programming is the type of polymorphism your lanuage doesn’t support.  I hope I’ve given you some resources to learn about shapeless and generic programming.  </p>","frontmatter":{"title":"Top 10 Shapeless Resources","date":"December 26, 2018","author":"Adam Gordon Bell","twitter":"adamgordonbell","bio":"Adam Gordon Bell is a Scala developer, who also hosts a <a href=\"https://corecursive.com\">podcast on software development</a>"}}},"pageContext":{"slug":"/shapeless/","previous":{"fields":{"slug":"/about/"},"frontmatter":{"title":"About && Contribute"}},"next":{"fields":{"slug":"/tech-podcasts/"},"frontmatter":{"title":"Top 10 Tech Podcasts"}}}}