{"data":{"site":{"siteMetadata":{"title":"One is Mine","author":"Adam Gordon Bell"}},"markdownRemark":{"id":"2adcc815-64ca-561b-b0c5-15ab1ede2a02","excerpt":"1.  Software Engineering Daily With one episdoe a business day, and a focused format, Jeff at SEDaily is one of my favorite podcasts. My first podcast interview…","html":"<h3>1. <a href=\"\">Software Engineering Daily</a></h3>\n<p>With one episdoe a business day, and a focused format, Jeff at SEDaily is one of my favorite podcasts. My first podcast interview was also as a guest host on SEDaily, so I can’t say enough good things about this podcast.</p>\n<h3>2. <a href=\"\">Data Skeptic</a></h3>\n<p>I’m not sure how I got subscribed to data skeptic, as a I’m not a data scientist of any sort.  But I’m glad I am.  My favorite thing is the miny epsidoes where Kyle explains to ??? a concept.  I think it is very impressive that she comes to these cold, from another background and is recorded.  To me that is a frightening endevaour.</p>\n<h3>3. <a href=\"\">CoRecursive</a></h3>\n<p>This is my podcast.  Jeff at SEDaily gave me the format, in depth technical interviews.  I try to interview smart people about technical topics that are deep and avoid tech news and trivia.  I also try to keep it casual in tone.  Whether I succeed at all or any of these is an open question, but doing the interviews has been so much fun.</p>\n<h3>4. <a href=\"\">Mapping The Journey</a></h3>\n<p>I’m not sure if this podcast is still being made but some heavy hitters have been interviewed.</p>\n<h3>5. <a href=\"\">.net Rocks</a></h3>\n<p>The first podcast I listened to was The Daily Source Code with Adam Curry, but mainly I recall it being about podcasts and podcasting.  .Net Rocks was as fun interview show about .net and since I had recently started writing C# for a living, I jump on this one write away.   This must have been 12 or more years ago and though I don’t listen anymore, it has to get a shout out.</p>\n<h3>6. <a href=\"\">The New Reustacean</a></h3>\n<p>Chris has this podcast about learning Rust.  And he just narrates it to the listener.  I think that is just such an challenging and intimate format and Chris pulls it off everytime.</p>\n<h3>7. <a href=\"\">ScalaWags</a></h3>\n<p>Fun group interviews about scala.  No longer being made, but a great podcast.</p>\n<h3>8. <a href=\"\">HaskellCast</a></h3>\n<p>Very few epsidoes of this podcast were ever made, but when they were made I was pretty focused on learning haskell.  I think they should pick it back up.</p>\n<h3>9. <a href=\"\">Functional Geekery</a></h3>\n<h3>10. <a href=\"\">Hanselminutes</a></h3>\n<p>There we go.  So shapeless is geneic programming and generic programming is the type of polymorphism your lanuage doesn’t support.  </p>","frontmatter":{"title":"Top 10 Tech Podcasts","date":"December 26, 2018","author":"Adam Gordon Bell","twitter":"adamgordonbell","bio":"Adam Gordon Bell is a Scala developer, who also hosts a podcast on software development"}}},"pageContext":{"slug":"/tech-podcasts/","previous":null,"next":{"fields":{"slug":"/shapeless/"},"frontmatter":{"title":"Top 10 Shapeless Resources"}}}}